{
  "project_name": "CrewAI",
  "domain": "Real estate — анализ договоров купли‑продажи (Россия)",
  "description": "Система для аналитики договоров купли-продажи для команды агентства недвижимости, расположенного в РФ. Обеспечивает загрузку и автоматическую обработку входящих документов (Microsoft Word, PDF), извлечение ключевых положений и рисков, поддержание актуальности правовой информации и предоставление результатов через веб-интерфейс. Интеграция с Nextcloud для хранения/обмена документами.",
  "required_capabilities": [
    "Приём и парсинг документов: DOCX, DOC, PDF (включая сканированные PDF с OCR).",
    "Нормализация и извлечение структуры документа (разделы, пункты, даты, стороны).",
    "Извлечение ключевых сущностей: имена, адреса, суммы, сроки, обязанности сторон, штрафы, условия перехода прав.",
    "Юридическая классификация и сопоставление с актуальными нормами законодательства РФ (подсказки/ссылки на нормативные акты).",
    "Оценка рисков и подсветка потенциально проблемных клаузул (risk scoring).",
    "Автоматическая генерация кратких и развернутых резюме/подсказок для сотрудника агентства.",
    "Рекомендации по правкам (шаблоны/рекомендованные формулировки) и формирование контрольных чек-листов для проверки договоров.",
    "Интеграция с Nextcloud (чтение/запись/версионирование файлов, аутентификация через Nextcloud).",
    "Веб-интерфейс для просмотра, аннотации и управления документами (целевой пользователь — сотрудник агентства).",
    "Механизм отслеживания и обновления правовой базы (агент/служба, периодическая проверка изменений в законодательстве).",
    "Логи, аудит действий пользователей и история версий/аннотаций для обеспечения прослеживаемости изменений.",
    "Права доступа и аутентификация (RBAC, поддержка корпоративной SSO при необходимости).",
    "Возможность экспорта отчётов (PDF, DOCX) и выгрузки результатов анализа.",
    "Пакетная обработка документов и асинхронные очереди задач для тяжёлых операций (OCR, индексирование, векторизация).",
    "Поиск по содержимому и полнотекстовый поиск, в т.ч. векторный поиск для семантического поиска по прецедентам/похожим договорам."
  ],
  "integrations": {
    "web_search": {
      "required": true,
      "purpose": "получение и поддержание актуальной информации по законодательству, извлечение контекстных ссылок на нормы",
      "notes": "Можно реализовать через API правовых баз/справочных систем и/или общие веб-поисковые API (при соблюдении политики конфиденциальности). Требует уточнения политики доступа в интернет и допустимых источников."
    },
    "databases": [
      "Реляционная БД (например, PostgreSQL) — метаданные, пользователи, аудиты.",
      "Хранилище документов (Nextcloud + объектное хранилище или filesystem).",
      "Векторная база (например, Milvus, Pinecone или аналог) — для семантического поиска/эмбеддингов.",
      "Кэш (Redis) — очереди, сессии, быстрые lookup."
    ],
    "apis": [
      "Nextcloud API (WebDAV/REST) — обязательная интеграция.",
      "OCR API (Tesseract локально или облачные OCR при разрешении доступа в интернет).",
      "Юридические/правовые API (если доступны) для актуальной правовой информации.",
      "Веб-поисковые API (Google, Yandex или специализированные правовые агрегаторы) — при разрешении доступа в интернет.",
      "Внешние сервисы авторизации (опционально): OAuth/SSO."
    ]
  },
  "constraints": {
    "cost_priority": "сбалансированный",
    "quality_scale": "medium (ориентировочно 3/5) — ожидается компромисс между стоимостью и качеством; достаточная надёжность и тестируемость, но без премиального уровня enterprise‑SLA на старте.",
    "non_functional": [
      "Требование по расположению данных: так как организация в РФ — учитывать требования российского законодательства по хранению и обработке персональных данных (надо уточнить).",
      "Высокая точность извлечения для ключевых полей (даты, суммы, стороны) — целевой уровень точности должен быть согласован.",
      "Безопасность: шифрование данных at-rest/in-transit, аудит действий, разграничение прав доступа.",
      "Производительность: время отклика для интерактивного анализа — целевой порог нужно уточнить (например, <5 с для резюме одного документа), пакетная обработка — через очередь/фоновые воркеры.",
      "Надёжность: резервное копирование и восстановление, retention policy для логов и документов."
    ]
  },
  "deployment": {
    "docker_required": false,
    "services_list": [
      {
        "name": "web_frontend",
        "description": "Веб-приложение для сотрудников (UI/UX), аутентификация, просмотр и аннотации документов."
      },
      {
        "name": "api_backend",
        "description": "REST/GraphQL API для бизнес-логики, интеграций и управления задачами."
      },
      {
        "name": "document_processor_worker",
        "description": "Фоновые задачи: парсинг DOCX/PDF, OCR, извлечение сущностей, генерация эмбеддингов."
      },
      {
        "name": "nextcloud_connector",
        "description": "Компонент интеграции с Nextcloud (WebDAV/REST, синхронизация, webhook-подписки)."
      },
      {
        "name": "database",
        "description": "Реляционная БД (Postgres) для метаданных и логов."
      },
      {
        "name": "vector_store",
        "description": "Векторная БД/индекс для семантического поиска."
      },
      {
        "name": "search_index",
        "description": "Полнотекстовый поисковый индекс (например, ElasticSearch/Opensearch)."
      },
      {
        "name": "scheduler",
        "description": "Планировщик задач для периодической проверки законодательства / обновлений."
      },
      {
        "name": "monitoring_logging",
        "description": "Сервисы мониторинга, алертинга и централизованного логирования (Prometheus/Grafana, ELK/Opensearch)."
      },
      {
        "name": "backup_service",
        "description": "Резервное копирование и восстановление документов и БД."
      }
    ],
    "notes": "Пользователь отказался от Docker-контейнеризации на первом этапе (docker_required=false). Рекомендуется всё же предусмотреть возможность контейнеризации как опцию (простая Dockerfile-структура и Docker Compose), чтобы упростить CI/CD и переносимость в будущем. Если в будущем потребуется оркестрация — Kubernetes как опция для масштабирования."
  },
  "documentation": {
    "languages": [
      "ru",
      "en"
    ],
    "types": {
      "user_documentation": "Bilingual (RU/EN) — инструкции для сотрудников агентства, примеры использования, FAQ.",
      "technical_documentation": "Bilingual (RU/EN) — архитектура системы, API спецификации, инструкции по развертыванию и эксплуатации, схемы безопасности, инструкции по резервному копированию/восстановлению.",
      "dev_onboarding": "Технические гайды и соглашения по коду, требования к тестам и CI/CD (предпочтительно EN для внешних подрядчиков)."
    }
  },
  "user_preferences": {
    "original_request_summary": "Команда аналитики договоров купли-продажи агентства недвижимости, расположенного в РФ. Нужна актуальная информация по законодательству, обработка входящих файлов Microsoft Word и PDF. Целевой пользователь — сотрудник агентства. Интерфейс — веб. Интеграция с Nextcloud.",
    "cost_vs_quality": "сбалансированный",
    "documentation_languages": [
      "ru",
      "en"
    ],
    "docker_required": false,
    "docker_notes": "Пользователь указал, что контейнеризация не нужна. Необходимо подтвердить, допускается ли её как опция в будущем.",
    "internet_access_raw": "1",
    "internet_access_interpretation": "Ответ '1' получен; неформально вероятно означает 'Да' (доступ в интернет требуется). Требуется явное подтверждение у заказчика и уточнение ограничений/политик."
  },
  "implicit_requirements_and_constraints": [
    "Требуется OCR для сканированных PDF (имплицитно).",
    "Необходима поддержка различных версий DOC/DOCX — корректная обработка форматирования и вложенных объектов.",
    "Потребность в актуализации правовой базы предполагает задачу периодического веб-агента/крон-заданий с доступом к внешним источникам.",
    "Так как агентство в РФ — возможны требования по локализации данных на территории РФ и соответствие требованиям по обработке персональных данных (надо уточнить).",
    "Потребность в аудитах и хранении истории изменений/аннотаций (регуляторные/внутренние политики).",
    "Может потребоваться интеграция с корпоративной сетью/прокси и SSO (если в агентстве используется).",
    "Надо предусмотреть режим офлайн/локальной работы для случаев отсутствия доступа в интернет (если это критично)."
  ],
  "open_questions": [
    "Явно подтвердите необходимость доступа в интернет для агентов: Да/Нет. Если Да — перечислите допустимые домены/сервисы (например, официальные правовые базы, Yandex/Google, облачные OCR) и ограничения (прокси, белые списки, лимиты запросов).",
    "Подтвердите полный и окончательный список типов агентов/функций (например: агент обновления законодательства, агент пакетной/фоновй обработки документов, агент интерпретации/сопоставления с нормативами, агент диалога/помощник для сотрудников).",
    "Уточните требования к хранению данных и соответствию законам РФ (например, требуется ли хранение всех персональных данных на серверах, расположенных в РФ).",
    "Уточните характер хостинга: локальные серверы/виртуальные машины в ЦОД заказчика, облако (и какой провайдер), или гибрид? Это повлияет на решения по Docker/оркестрации и сетевой безопасности.",
    "Подробности по Nextcloud: self-hosted или облачный; версия Nextcloud; метод аутентификации (логин/пароль, OAuth, SSO); объём/структура существующих папок; требуется ли синхронизация в реальном времени или только периодический импорт.",
    "Ожидаемые нагрузки: среднее/пиковое количество документов в сутки, средний размер документа, требование SLA на время обработки одного документа и на время отклика веб‑интерфейса.",
    "Требования к безопасности: стандарты/сертификаты (ISO, ФЗ-152 о персональных данных), шифрование, retention policy для логов и документов.",
    "Требования к тестированию и качеству: уровень покрытия тестами, acceptance criteria для основных функций, необходимость прохождения внешнего аудита безопасности.",
    "Нужны ли интеграции с внутренними CRM/ERP/учётными системами агентства (и какие именно)?",
    "Можно ли в рамках бюджета предусмотреть опциональную контейнеризацию (Docker + Docker Compose) хотя бы для тестовой и staging-среды?"
  ]
}